---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.ElectricalSystem
source: html/e2380e85-d7b7-71ea-e0a0-0f72ef5b3e77.htm
---
# ElectricalSystem Members

Add elements into the system and connect them with the system using given connectors.